## Terraform plan  [job](https://circleci.com/gh/fr123k/kube-hetzner/144) 3ccfb07eed93baa1e7c4daafe6f05fdd008f7490 :white_check_mark:

Plan Summary:
```bash
Plan: 4 to add, 0 to change, 1 to destroy.
Plan: 4 to add, 0 to change, 1 to destroy.
```

Resource Summary:
```
  # hcloud_firewall.k3s has been changed
        # (6 unchanged blocks hidden)
  # hcloud_network.k3s has been changed
  # hcloud_ssh_key.default has been changed
─────────────────────────────────────────────────────────────────────────────
-/+ destroy and then create replacement
  # hcloud_server.agents[0] will be created
  # hcloud_server.agents[1] will be created
  # hcloud_server.control_planes[0] will be created
  # hcloud_server.first_control_plane is tainted, so must be replaced
-/+ resource "hcloud_server" "first_control_plane" {
─────────────────────────────────────────────────────────────────────────────
  # hcloud_network.k3s has been changed
  # hcloud_ssh_key.default has been changed
  # hcloud_firewall.k3s has been changed
        # (6 unchanged blocks hidden)
─────────────────────────────────────────────────────────────────────────────
-/+ destroy and then create replacement
  # hcloud_server.agents[0] will be created
  # hcloud_server.agents[1] will be created
  # hcloud_server.control_planes[0] will be created
  # hcloud_server.first_control_plane is tainted, so must be replaced
-/+ resource "hcloud_server" "first_control_plane" {
─────────────────────────────────────────────────────────────────────────────
```

<details>
    <summary>Show Details:</summary>

```bash

Initializing the backend...

Successfully configured the backend "http"! Terraform will automatically
use this backend unless the backend configuration changes.
2022/04/11 14:17:08 [DEBUG] GET http://localhost:6061/?type=git&repository=git@github.com:fr123k/tf-state.git&ref=main&state=hetzner/kube/state.json

Initializing provider plugins...
- Reusing previous version of hetznercloud/hcloud from the dependency lock file
- Reusing previous version of hashicorp/random from the dependency lock file
- Installing hetznercloud/hcloud v1.33.1...
- Installed hetznercloud/hcloud v1.33.1 (signed by a HashiCorp partner, key ID 5219EACB3A77198B)
- Installing hashicorp/random v3.1.2...
- Installed hashicorp/random v3.1.2 (signed by HashiCorp)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
2022/04/11 14:17:10 [DEBUG] LOCK http://localhost:6061/?type=git&repository=git@github.com:fr123k/tf-state.git&ref=main&state=hetzner/kube/state.json
Acquiring state lock. This may take a few moments...
2022/04/11 14:17:11 [DEBUG] GET http://localhost:6061/?type=git&repository=git@github.com:fr123k/tf-state.git&ref=main&state=hetzner/kube/state.json
random_password.k3s_token: Refreshing state... [id=none]
hcloud_network.k3s: Refreshing state... [id=1546887]
hcloud_ssh_key.default: Refreshing state... [id=6113063]
hcloud_firewall.k3s: Refreshing state... [id=362128]
hcloud_network_subnet.k3s: Refreshing state... [id=1546887-10.0.0.0/16]
hcloud_server.first_control_plane: Refreshing state... [id=19580232]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # hcloud_firewall.k3s has been changed
  ~ resource "hcloud_firewall" "k3s" {
        id     = "362128"
        name   = "k3s-firewall"
        # (1 unchanged attribute hidden)

      + apply_to {
          + server = 19580232
        }

        # (6 unchanged blocks hidden)
    }
  # hcloud_network.k3s has been changed
  ~ resource "hcloud_network" "k3s" {
        id                = "1546887"
      + labels            = {}
        name              = "k3s-net"
        # (2 unchanged attributes hidden)
    }
  # hcloud_ssh_key.default has been changed
  ~ resource "hcloud_ssh_key" "default" {
        id          = "6113063"
      + labels      = {}
        name        = "K3S terraform module - Provisioning SSH key"
        # (2 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # hcloud_server.agents[0] will be created
  + resource "hcloud_server" "agents" {
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = [
          + 362128,
        ]
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "engine"      = "k3s"
          + "k3s_upgrade" = "true"
          + "provisioner" = "terraform"
        }
      + location                   = "fsn1"
      + name                       = "k3s-agent-0"
      + rebuild_protection         = false
      + rescue                     = "linux64"
      + server_type                = "cx21"
      + ssh_keys                   = [
          + "6113063",
        ]
      + status                     = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.0.4"
          + mac_address = (known after apply)
          + network_id  = 1546887
        }
    }

  # hcloud_server.agents[1] will be created
  + resource "hcloud_server" "agents" {
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = [
          + 362128,
        ]
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "engine"      = "k3s"
          + "k3s_upgrade" = "true"
          + "provisioner" = "terraform"
        }
      + location                   = "fsn1"
      + name                       = "k3s-agent-1"
      + rebuild_protection         = false
      + rescue                     = "linux64"
      + server_type                = "cx21"
      + ssh_keys                   = [
          + "6113063",
        ]
      + status                     = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.0.5"
          + mac_address = (known after apply)
          + network_id  = 1546887
        }
    }

  # hcloud_server.control_planes[0] will be created
  + resource "hcloud_server" "control_planes" {
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = [
          + 362128,
        ]
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "engine"      = "k3s"
          + "k3s_upgrade" = "true"
          + "provisioner" = "terraform"
        }
      + location                   = "fsn1"
      + name                       = "k3s-control-plane-1"
      + rebuild_protection         = false
      + server_type                = "cx11"
      + ssh_keys                   = [
          + "6113063",
        ]
      + status                     = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.0.3"
          + mac_address = (known after apply)
          + network_id  = 1546887
        }
    }

  # hcloud_server.first_control_plane is tainted, so must be replaced
-/+ resource "hcloud_server" "first_control_plane" {
      + backup_window              = (known after apply)
      ~ datacenter                 = "fsn1-dc14" -> (known after apply)
      ~ id                         = "19580232" -> (known after apply)
      ~ ipv4_address               = "49.12.186.81" -> (known after apply)
      ~ ipv6_address               = "2a01:4f8:c17:2d2d::1" -> (known after apply)
      ~ ipv6_network               = "2a01:4f8:c17:2d2d::/64" -> (known after apply)
        name                       = "k3s-control-plane-0"
      ~ status                     = "running" -> (known after apply)
        # (12 unchanged attributes hidden)

      - network {
          - alias_ips   = [] -> null
          - ip          = "10.0.0.2" -> null
          - mac_address = "86:00:00:0b:a3:20" -> null
          - network_id  = 1546887 -> null
        }
      + network {
          + alias_ips   = []
          + ip          = "10.0.0.2"
          + mac_address = (known after apply)
          + network_id  = 1546887
        }
    }

Plan: 4 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + agents_public_ip        = [
      + (known after apply),
      + (known after apply),
    ]
  + controlplanes_public_ip = [
      + (known after apply),
      + (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
2022/04/11 14:17:18 [DEBUG] UNLOCK http://localhost:6061/?type=git&repository=git@github.com:fr123k/tf-state.git&ref=main&state=hetzner/kube/state.json
Releasing state lock. This may take a few moments...

Initializing the backend...
2022/04/11 14:17:19 [DEBUG] GET http://localhost:6061/?type=git&repository=git@github.com:fr123k/tf-state.git&ref=main&state=hetzner/kube/state.json

Initializing provider plugins...
- Reusing previous version of hashicorp/random from the dependency lock file
- Reusing previous version of hetznercloud/hcloud from the dependency lock file
- Using previously-installed hashicorp/random v3.1.2
- Using previously-installed hetznercloud/hcloud v1.33.1

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
2022/04/11 14:17:20 [DEBUG] LOCK http://localhost:6061/?type=git&repository=git@github.com:fr123k/tf-state.git&ref=main&state=hetzner/kube/state.json
Acquiring state lock. This may take a few moments...
2022/04/11 14:17:20 [DEBUG] GET http://localhost:6061/?type=git&repository=git@github.com:fr123k/tf-state.git&ref=main&state=hetzner/kube/state.json
random_password.k3s_token: Refreshing state... [id=none]
hcloud_network.k3s: Refreshing state... [id=1546887]
hcloud_ssh_key.default: Refreshing state... [id=6113063]
hcloud_firewall.k3s: Refreshing state... [id=362128]
hcloud_network_subnet.k3s: Refreshing state... [id=1546887-10.0.0.0/16]
hcloud_server.first_control_plane: Refreshing state... [id=19580232]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # hcloud_network.k3s has been changed
  ~ resource "hcloud_network" "k3s" {
        id                = "1546887"
      + labels            = {}
        name              = "k3s-net"
        # (2 unchanged attributes hidden)
    }
  # hcloud_ssh_key.default has been changed
  ~ resource "hcloud_ssh_key" "default" {
        id          = "6113063"
      + labels      = {}
        name        = "K3S terraform module - Provisioning SSH key"
        # (2 unchanged attributes hidden)
    }
  # hcloud_firewall.k3s has been changed
  ~ resource "hcloud_firewall" "k3s" {
        id     = "362128"
        name   = "k3s-firewall"
        # (1 unchanged attribute hidden)

      + apply_to {
          + server = 19580232
        }

        # (6 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # hcloud_server.agents[0] will be created
  + resource "hcloud_server" "agents" {
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = [
          + 362128,
        ]
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "engine"      = "k3s"
          + "k3s_upgrade" = "true"
          + "provisioner" = "terraform"
        }
      + location                   = "fsn1"
      + name                       = "k3s-agent-0"
      + rebuild_protection         = false
      + rescue                     = "linux64"
      + server_type                = "cx21"
      + ssh_keys                   = [
          + "6113063",
        ]
      + status                     = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.0.4"
          + mac_address = (known after apply)
          + network_id  = 1546887
        }
    }

  # hcloud_server.agents[1] will be created
  + resource "hcloud_server" "agents" {
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = [
          + 362128,
        ]
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "engine"      = "k3s"
          + "k3s_upgrade" = "true"
          + "provisioner" = "terraform"
        }
      + location                   = "fsn1"
      + name                       = "k3s-agent-1"
      + rebuild_protection         = false
      + rescue                     = "linux64"
      + server_type                = "cx21"
      + ssh_keys                   = [
          + "6113063",
        ]
      + status                     = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.0.5"
          + mac_address = (known after apply)
          + network_id  = 1546887
        }
    }

  # hcloud_server.control_planes[0] will be created
  + resource "hcloud_server" "control_planes" {
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = [
          + 362128,
        ]
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "engine"      = "k3s"
          + "k3s_upgrade" = "true"
          + "provisioner" = "terraform"
        }
      + location                   = "fsn1"
      + name                       = "k3s-control-plane-1"
      + rebuild_protection         = false
      + server_type                = "cx11"
      + ssh_keys                   = [
          + "6113063",
        ]
      + status                     = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.0.3"
          + mac_address = (known after apply)
          + network_id  = 1546887
        }
    }

  # hcloud_server.first_control_plane is tainted, so must be replaced
-/+ resource "hcloud_server" "first_control_plane" {
      + backup_window              = (known after apply)
      ~ datacenter                 = "fsn1-dc14" -> (known after apply)
      ~ id                         = "19580232" -> (known after apply)
      ~ ipv4_address               = "49.12.186.81" -> (known after apply)
      ~ ipv6_address               = "2a01:4f8:c17:2d2d::1" -> (known after apply)
      ~ ipv6_network               = "2a01:4f8:c17:2d2d::/64" -> (known after apply)
        name                       = "k3s-control-plane-0"
      ~ status                     = "running" -> (known after apply)
        # (12 unchanged attributes hidden)

      - network {
          - alias_ips   = [] -> null
          - ip          = "10.0.0.2" -> null
          - mac_address = "86:00:00:0b:a3:20" -> null
          - network_id  = 1546887 -> null
        }
      + network {
          + alias_ips   = []
          + ip          = "10.0.0.2"
          + mac_address = (known after apply)
          + network_id  = 1546887
        }
    }

Plan: 4 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + agents_public_ip        = [
      + (known after apply),
      + (known after apply),
    ]
  + controlplanes_public_ip = [
      + (known after apply),
      + (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
2022/04/11 14:17:24 [DEBUG] UNLOCK http://localhost:6061/?type=git&repository=git@github.com:fr123k/tf-state.git&ref=main&state=hetzner/kube/state.json
Releasing state lock. This may take a few moments...

```
</details>

<!-- github-comment: {"JobID":"3e7914cc-0197-437d-818c-22af2c2a638a","JobName":"terraform-plan","SHA1":"3ccfb07eed93baa1e7c4daafe6f05fdd008f7490","TemplateKey":"plan","Vars":{}} -->